# Текстовое описание решения

## Задача

Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

## Примеры

[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]

[“1234”, “1567”, “-2”, “computer science”] → [“-2”]

[“Russia”, “Denmark”, “Kazan”] → []

## Описание решения

1. Запрашиваем вводные данные у пользователя с применением текстовой подсказки, в которой просим пользователя разделить элементы с помощью точки с запятой (;). Для текстовой подсказки используется функция Console.WriteLine. Вот так: Console.WriteLine("Введите элементы для массива через точки с запятой \";\" :").

2. Сохраняем введенные данные в переменную с именем *"input"*. Данная переменная имеет тип данных *string*. Вот так: string? input = InputCheck(Console.ReadLine()). А с помощью метода *InputCheck* осуществляем проверку того, что пользователь ввел хотя бы один символ.

__Примечание__

*В C# вопросительный знак после типа указывает на то, что переменная имеет тип nullable. Использование нулевых типов полезно в ситуациях, когда значение может быть недоступно или когда необходимо отличить пустое значение от отсутствующего. Например, при чтении пользовательского ввода из консоли он может быть пустым (допустимая строка, не содержащая символов) или полностью нулевым, если ввода не было вообще. Использование нулевых типов позволяет более эффективно справляться с подобными сценариями.*

*Однако в моем коде использование string? является излишним и может быть заменено на string. Поскольку Console.ReadLine() возвращает строку, то нет необходимости явно объявлять ввод как string? Вместо этого можно напрямую использовать string input = Console.ReadLine()*

*Вопросительный знак используется только с целью избежать навязчивого подчеркивания, подсказывающего, что значение может принимать null value.*

3. Создаем массив с именем *myArray* и типом данных *string*, который заполняется текстовыми елементами из введенных ранее пользователем данных и сохраненных в переменную *input*. Массив создается с помощью функции *Split*, где разделителем элементов является точка с запятой (;), а с помощью метода *StringSplitOptions.RemoveEmptyEntries* обрабатываются (удаляются) пустые значения, введенные двумя последовательными точками с запятой (";;"). Вот так: string[] myArray = input.Split(';', StringSplitOptions.RemoveEmptyEntries).

4. При помощи цикла for и функции Trim все элементы массива последовательно очищаются от пробелов в начале и в конце значения. Вот так: 

for(int i = 0; i < myArray.Length; i++)
{
    myArray[i] = myArray[i].Trim();
}

5. Далее, создаем новый текстовый массив с именем newArray, в который, при помощи метода GetNewArray записываем только те значения, которые удовлетворяют условию задачи (длина меньше, либо равна 3 символам). Вот так: string[] newArray = GetNewArray(myArray).

6. И на последнем этапе выводим текстовую строку с напоминанием, что именно выводится в консоль, и осуществляем печать всех элементов созданного массива. Вот так: 

Console.WriteLine("Строки нового массива длина которых меньше, либо равна 3 символам:");
PrintArray(newArray);

## Описание используемых в коде методов

1. **InputCheck**

Данный метод принимает "на вход" данные с типом *string* и возвращает данные с типом *string*. Внутри метода осуществляется проверка того, что пользователь ввел хотя бы один символ. Проверка осуществляется с помощью функции *if* и метода string.IsNullOrEmpty. Далее используется рекурсия с целью получить от пользователя необходимые значения для дальнейшей обработки. Вот так:

string InputCheck(string value)

{

    if (string.IsNullOrEmpty(value))
    {
        Console.WriteLine("Введено пустое значение. Необходимо ввести хотя бы один символ:");
        string? newValue = Console.ReadLine();
        return InputCheck(newValue);
    }
    else
    {
        return value;
    }
}

2. **GetNewArray**

Данный метод является основным для данной задачи и именно в нем создается новый массив, удовлетворяющий условиям задачи. 

На первом этапе определяется размерность для нового массива. Для этого создается переменная *count* с типом данных int, в которую сохраняется числовое значение равное количеству эелементов, удовлетворяющих следующему условию: значение не является пустым и не имеет признак null, длина значения менее четырех символов и значениее не является пробелом (в случае, если пользователь ввел пробел между двумя точками с запятой (; ;) предполагаем, что это было сделано по ошибке). Для получения данного значения используется метод array.Count.

Получив количество элементов, удовлетворяющих условию задачи, создаем массив размерностю равной данному количеству. Задаем новую переменную *newArrayIndex* с типом данных int для того, чтобы использовать ее в последующем цикле для заполнения массива.

Следующим шагом используем цикл for и функцию if для того, чтобы в созданный массив newArray записывались значения из общего массива myArray, которые удовлетворяют требованиям задачи (значение не является пустым и не имеет признак null, длина значения менее четырех символов и значениее не является пробелом).

В итоге, метод GetNewArray возвращает новый массив newArray, в котором находятся только нужные нам значения. Вот так:

string[] GetNewArray(string[] array)

{

    int count = array.Count(value => !string.IsNullOrEmpty(value) && value.Length < 4 && !(value == " "));
    string[] newArray = new string[count];
    int newArrayIndex = 0;

    for (int i = 0; i < array.Length; i++)
    {
        string value = array[i];
        if (value.Length < 4 && !string.IsNullOrEmpty(value) && !(value == " "))
        {
            newArray[newArrayIndex] = value;
            newArrayIndex++;
        }
    }
    return newArray;
}

3. **PrintAray**

С помощью данного метода печатаем в консоль все элеметы массива. Данный метод является методом с типом *void*, который на вход принимает массив с типом string, но не возвращает никакого значения, просто перебирает все элемены массива циклом for и последовательно печатает в консоль каждое значение при помощи метода Console.WriteLine. Вот так:

void PrintArray(string[] array)

{
    
    for (int i = 0; i < array.Length; i++)
    {
        Console.WriteLine($"{i + 1}: {array[i]}");
    }
}